IlleniumDillon/MM32F5277/MM32/MM32_Registers.h
#ifndef _MM32_REGISTERS_H_
#define _MM32_REGISTERS_H_

#include "MM32_ADC1Reg.h"
#include "MM32_ADC2Reg.h"
#include "MM32_BKPReg.h"
#include "MM32_COMPReg.h"
#include "MM32_CORDICReg.h"
#include "MM32_CRCReg.h"
#include "MM32_CRSReg.h"
#include "MM32_DACReg.h"
#include "MM32_DBGMCUReg.h"
#include "MM32_DMA1Reg.h"
#include "MM32_DMA2Reg.h"
#include "MM32_ENETReg.h"
#include "MM32_EXTIReg.h"
#include "MM32_FLASHReg.h"
#include "MM32_FLEXCAN1Reg.h"
#include "MM32_FLEXCAN2Reg.h"
#include "MM32_FSMCReg.h"
#include "MM32_GPIOAReg.h"
#include "MM32_GPIOBReg.h"
#include "MM32_GPIOCReg.h"
#include "MM32_GPIODReg.h"
#include "MM32_GPIOEReg.h"
#include "MM32_GPIOFReg.h"
#include "MM32_GPIOGReg.h"
#include "MM32_GPIOHReg.h"
#include "MM32_GPIOIReg.h"
#include "MM32_I2C1Reg.h"
#include "MM32_I2C2Reg.h"
#include "MM32_IWDGReg.h"
#include "MM32_LPTReg.h"
#include "MM32_LPUReg.h"
#include "MM32_MDSReg.h"
#include "MM32_PWRReg.h"
#include "MM32_QSPIReg.h"
#include "MM32_RCCReg.h"
#include "MM32_RTCReg.h"
#include "MM32_SPI1Reg.h"
#include "MM32_SPI2Reg.h"
#include "MM32_SPI3Reg.h"
#include "MM32_SYSCFGReg.h"
#include "MM32_TIM1Reg.h"
#include "MM32_TIM8Reg.h"
#include "MM32_TIM2Reg.h"
#include "MM32_TIM5Reg.h"
#include "MM32_TIM3Reg.h"
#include "MM32_TIM4Reg.h"
#include "MM32_TIM6Reg.h"
#include "MM32_TIM7Reg.h"
#include "MM32_UART1Reg.h"
#include "MM32_UART2Reg.h"
#include "MM32_UART3Reg.h"
#include "MM32_UART4Reg.h"
#include "MM32_UART5Reg.h"
#include "MM32_UART6Reg.h"
#include "MM32_UART7Reg.h"
#include "MM32_USBReg.h"
#include "MM32_WWDGReg.h"

#endif
